Autodesk.Revit.DB.Structure.RebarHookType.GetDefaultHookLength(System.Double)
Computes the default hook length, which is equal to barDiameter * multiplier.
This method is obsolete in Revit 2015. Use getDefaultHookExtension instead.